# BuiltInFailures.GridChainSketchFailures Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
BuiltInFailures..::..GridChainSketchFailures Properties
BuiltInFailures..::..GridChainSketchFailures Class See Also
---
The BuiltInFailures..::..GridChainSketchFailures type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ClosedLoop | GridChain sketch contains a closed loop. |
| InvalidSketch | Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines. |
| MoreThanOneLoop | GridChain sketch contains more than one loop. |
| OverlappingLines | GridChain sketch contains lines which overlap. |

# See Also
BuiltInFailures..::..GridChainSketchFailures Class
Autodesk.Revit.DB Namespace